app/controllers/articles_controller.rb

  def create
	@article = Article.new(params_article)
	if @article.save
---
INSERT INTO "articles" ("content", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "Ini adalah content dari article yang berjudul \"Ini Title\""], ["created_at", "2014-10-08 03:10:16.561998"], ["title", "Ini Title"], ["updated_at", "2014-10-08 03:10:16.561998"]]

  def show
	@article = Article.find_by_id(params[:id])
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = 5 LIMIT 1

  def edit
	@article = Article.find_by_id(params[:id])
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = 5 LIMIT 1

  def update
	@article = Article.find_by_id(params[:id])
	if @article.update(params_article)
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = 5 LIMIT 1
UPDATE "articles" SET "content" = $1, "updated_at" = $2 WHERE "articles"."id" = 5  [["content", "Ini adalah content dari judul artikel \"Title Test\""], ["updated_at", "2014-10-08 04:11:45.651950"]]

  def destroy
	@article = Article.find_by_id(params[:id])
	if @article.destroy
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = 6 LIMIT 1
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 6]]